01_software/01_editors/02_pearls/editors_1_pearls.html
<!DOCTYPE html>
<html>
<head>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/blog-1/css/main.css"/>
</head>
<body>
<div id="content" class="content">
<pre>
<code>> ./blog-1/01_software/01_editors/02_pearls/editors_1_pearls.html</code>
</pre>

<p>
<p><a href="https://hnvy.github.io/blog-1/">Home page</a></p>
<p><a href="https://github.com/hnvy/blog-1/edit/main/01_software/01_editors/02_pearls/editors_1_pearls.html">ESotP</a></p>
</p>

<p>
<hr>
</p>

<div id="outline-container-org47fc157" class="outline-2">
<h2 id="org47fc157">E#007 (08/07/2022) - contents table in plain text. (V)</h2>
<div class="outline-text-2" id="text-org47fc157">
<p>
<a href="../01_logs/editors_1_logs.html#org7018e49">Link to log entry</a>
</p>
<ul class="org-ul">
<li>Encode your headings in Vim using <code>sha256</code></li>
<li>Type <code>:let @"=sha256('____')</code> (replace the <code>____</code> the heading title)</li>
<li>Paste the <code>sha256</code> hash at the start of the heading line (so you end up with something like this <code>HASH# Heading 1</code>)</li>
<li>Yank the <code>HASH# Heading 1</code> line and paste it at the start of your document under a <code># Table of Contents</code> heading</li>
<li>Place the cursor at a hash, and press <code>#</code> to jump to the corresponding heading</li>
<li>You can use the following mapping to assist you with the above: <code>nmap &lt;M-0&gt; ^v$hy:let @"=sha256('&lt;C-r&gt;"')&lt;CR&gt;Pyygg</code> (this maps the steps 1-6 to <code>Alt-0</code>. You can then go down and paste the content using <code>p</code>).</li>
</ul>
</div>
</div>

<div id="outline-container-orgd5064e5" class="outline-2">
<h2 id="orgd5064e5">E#006 (05/03/2022) - Vim, what does X mean? (V)</h2>
<div class="outline-text-2" id="text-orgd5064e5">
<p>
<a href="../01_logs/editors_1_logs.html#org5bcae9c">Link to log entry</a>
</p>
<ul class="org-ul">
<li>To search for things on Google from within Vim, add the following code to your <code>vimrc</code>:
<ul class="org-ul">
<li><code>vmap &lt;C-3&gt; "zy:let @z = substitute(@z,' ','+','g')&lt;CR&gt;:exec ":silent ! start https://www.google.com/search?q=". @z. ""&lt;CR&gt;&lt;CR&gt;</code></li>
</ul></li>
<li>This is how it works:
<ul class="org-ul">
<li>Go into Visual mode by pressing <code>v</code>, and highlight the words of interest</li>
<li>Press <code>Ctrl+3</code> (by modifying the <code>&lt;C-3&gt;</code> in the line of code above, you can make this keyboard shortcut to whatever you want)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org92d4798" class="outline-2">
<h2 id="org92d4798">E#005 (21/05/2021) - jump like a rabbit! (V)</h2>
<div class="outline-text-2" id="text-org92d4798">
<p>
<a href="../01_logs/editors_1_logs.html#orgf9b7ba1">Link to log entry</a>
</p>
<ul class="org-ul">
<li>Vim has several different modes. You use Normal mode to navigate through your text. Whereas you use Insert mode to insert text (obviously). Typing <code>:</code> will activate Command mode.</li>
<li><code>w</code> to jump FORWARD to the start of the next word in a sentence (thinks that hyphens, dots, commas, etc. are actually spaces, and will hence treat them as such). For example, "Vim-is-a-modal-text-editor" will be treated as having 11 words.
<ul class="org-ul">
<li><code>e</code> will do the same thing, except it will jump to the end of the current word.</li>
<li><code>b</code> will do the same thing, except it goes BACKWARD.</li>
</ul></li>
<li><code>W</code> to jump FORWARD to the start of the next word in a sentence (thinks that ONLY the words separated by spaces are true words). For example, "Vim-is-a-modal-text-editor" will be treated as having only one word.
<ul class="org-ul">
<li><code>E</code> will do the same thing, except it will jump to the end of the current word.</li>
<li><code>B</code> will do the same thing, except it goes BACKWARD.</li>
</ul></li>
<li>Save and exit. See this <a href="../02_pearls/editors_1_pearls.html#e3-21042021---notepad--vim">pearl entry</a> to learn more about a third method.:
<ul class="org-ul">
<li><code>:x</code> will do the same thing as <code>:wq</code> except that it will not save the file if you have not made a change.</li>
<li><code>ZZ</code> will do the same thing as <code>:x</code> (and hence <code>:wq</code>).</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8526d38" class="outline-2">
<h2 id="org8526d38">E#004 (10/05/2021) - a clipboard dilemma. (V)</h2>
<div class="outline-text-2" id="text-org8526d38">
<p>
<a href="../01_logs/editors_1_logs.html#orgd75c69a">Link to log entry</a>
</p>
<ul class="org-ul">
<li><code>yy</code> to yank (copy) the line into the Vim register.
<ul class="org-ul">
<li>Combine this with <code>p</code> to get <code>yyp</code> and hence duplicate the current line.</li>
</ul></li>
<li><code>yw</code> to yank (copy) the word under the cursor into the Vim register.</li>
<li><code>p</code> to paste the content stored in the Vim register AFTER the cursor.</li>
<li><code>P</code> to paste the content stored in the Vim register BEFORE the cursor.</li>
<li><code>u</code> to undo a change.</li>
<li><code>U</code> to undo all changes on the CURRENT line.</li>
<li><code>Ctrl+r</code> to redo.</li>
<li>Go to line X
<ul class="org-ul">
<li><code>:</code> and then any number of your choice. This will take you to that particular line in your current file. So, <code>:33</code> will take me to line 33.</li>
<li>Type a number followed by <code>G</code> (e.g., the example above would be <code>33G</code>) to get the same result.</li>
<li>Type a number followed by <code>gg</code> (e.g., the example above would be <code>33gg</code>) to get the same result.</li>
</ul></li>
<li><code>/</code> followed by any word of your choice to search FORWARD. After that, you can press <code>n</code> to cycle through the matches (use <code>N</code> to search in the opposite direction).</li>
<li><code>?</code> followed by any word of your choice to search BACKWARD. After that, you can press <code>n</code> to cycle through the matches (use <code>N</code> to search in the opposite direction).</li>
</ul>
</div>
</div>

<div id="outline-container-org03354ca" class="outline-2">
<h2 id="org03354ca">E#003 (21/04/2021) - Notepad++ &gt; Vim?! (V)</h2>
<div class="outline-text-2" id="text-org03354ca">
<p>
<a href="../01_logs/editors_1_logs.html#orga8b1a4c">Link to log entry</a>
</p>
<ul class="org-ul">
<li><code>x</code> to delete the character AFTER the cursor.</li>
<li><code>X</code> to delete the character BEFORE the cursor.</li>
<li><code>A</code> to insert text at the end of the line.</li>
<li><code>I</code> to insert text at the start of the line.</li>
<li><code>a</code> to insert text AFTER the cursor.</li>
<li><code>i</code> to insert text BEFORE the cursor.</li>
<li><code>dd</code> to delete the whole line.</li>
<li><code>d$</code> or <code>D</code> to delete from the current position to the end of the line.</li>
<li><code>:wq</code> to write (hence the <code>w</code>) the changes, and then quit Vim (hence the <code>q</code>). This will save your buffer whether or not you made a change.</li>
</ul>
</div>
</div>

<div id="outline-container-orgae35ea3" class="outline-2">
<h2 id="orgae35ea3">E#002 (20/04/2021) - vimtutor. (V)</h2>
<div class="outline-text-2" id="text-orgae35ea3">
<p>
<a href="../01_logs/editors_1_logs.html#org5f3b26d">Link to log entry</a>
</p>
<ul class="org-ul">
<li>The <code>vimtutor</code> file is located in <code>/Vim/vim82/tutor</code>.</li>
<li><code>:set guifont=*</code> to change the font of the interface.</li>
<li><code>i</code> to enter Insert mode.</li>
<li>Use the Escape button, <code>Esc</code>, to return to Normal mode.</li>
<li>Whilst in Normal mode, you can move up, down, right, and left by using the following keys: <code>k</code>, <code>j</code>, <code>l</code>, and <code>h</code>, respectively (remember, <code>j</code> looks like a down arrow!).</li>
</ul>
</div>
</div>

<div id="outline-container-org9e2ad22" class="outline-2">
<h2 id="org9e2ad22">E#001 (19/04/2021) - day 0. (V)</h2>
<div class="outline-text-2" id="text-org9e2ad22">
<p>
<a href="../01_logs/editors_1_logs.html#org3197b89">Link to log entry</a>
</p>
<ul class="org-ul">
<li>To enter commands into Vim, you should write <code>:</code>. After doing so, you will notice that your cursor has moved to the bottom of the screen.</li>
<li><code>:q!</code> to quit Vim without saving the changes.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
